/*********************************************************************************************************
**				                              HGOS(YOS)
**
**                                  (c) Copyright 2012-2015, Yang Wensen
**                                           All Rights Reserved
**
**                                                  V1.04
*********************************************************************************************************/
#ifndef OS_MBOX_H
#define OS_MBOX_H
//********************************************************************************************************
typedef struct
{
	void *Msg;//消息存放处
	OS_WAIT_LIST_t WaitList;
}OS_MBX_t;
//********************************************************************************************************
extern uint8 OSMbxCreate(OS_MBX_t *pmail);//建立邮箱（仅初始化，邮箱在外面建立）
extern uint8 OSMbxPost(OS_MBX_t *pmail,void *msg);//pmail通过哪个邮箱发送，msg为消息指针
extern uint8 OSMbxPend(OS_MBX_t *pmail,OS_TICK_t time_out,void **ppmsg);//pmail从哪个邮箱收消息，ppmsg消息指针要保存到哪,timeout为等待消息的超时时间
#define OSMbxIntPost(pmail,msg)		OSMbxPost(pmail,msg)//pmail通过哪个邮箱发送，msg为消息指针
/*********************************************************************************************************
**                            End Of File
********************************************************************************************************/
#endif
