#include "common_zpyws.h"
//******************************************************************************************************************************
extern void InitTimer4(uint8 pscr, uint8 match)
{
	SBF(CLK->PCKENR1, CLK_PCKENR1_TIM4);//使能外设时钟

	TIM4->IER = CC(TIM4_IER_UIE);//配置前先关闭所有中断使能
	TIM4->PSCR = pscr;//分频结果为PSCR寄存器值的2次方分之一,PSCR有效位数仅3位(0-8)
	TIM4->CNTR = 0;		//设定定时器的初值
	TIM4->ARR = match;	//设定定时器的自动重载值
	TIM4->EGR = TIM4_EGR_UG;//允许产生更新事件
	TIM4->CR1 = CC(TIM4_CR1_OPM)|CC(TIM4_CR1_URS)|CC(TIM4_CR1_UDIS)|TIM4_CR1_CEN;//非单次触发模式,到匹配值时马上中断,,计数器使能
	TIM4->IER = TIM4_IER_UIE;//配置前先关闭所有中断使能
}
//******************************************************************************************************************************
ISR(TIM4_OVR_UIF_vector)
{
	OSIntEnter();

	CBF(TIM4->SR1, TIM4_SR1_UIF);  // 清除更新中断标记，这步不能漏掉，否则会连续进入中断程序
//================================================================================
	OSTimeTick();
//================================================================================
	OSIntExit();
}
//******************************************************************************************************************************
